src/CF/Catalogs/НаправленияДеятельности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>НаправленияДеятельности</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ВидыДеятельности</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РуководительНаправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроВидыДеятельности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроЗакрепленныеСотрудники</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыДеятельности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОСтроке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗакрепленныеСотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольСотрудника</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыРолейСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОСтроке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Catalogs/НаправленияДеятельности/Ext/ManagerModule.bsl
// sza160218-0017 

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура НаПечать(ТабДок, Ссылка) Экспорт
	
	Макет = Справочники.НаправленияДеятельности.ПолучитьМакет("НаПечать");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НаправленияДеятельности.ВидДеятельности,
	|	НаправленияДеятельности.Код,
	|	ВЫРАЗИТЬ(НаправленияДеятельности.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
	|	НаправленияДеятельности.Наименование,
	|	НаправленияДеятельности.ПроВидыДеятельности,
	|	НаправленияДеятельности.ПроЗакрепленныеСотрудники,
	|	НаправленияДеятельности.РуководительНаправления,
	|	НаправленияДеятельности.ВидыДеятельности.(
	|		НомерСтроки,
	|		ВидДеятельности,
	|		Основной,
	|		ОСтроке
	|	),
	|	НаправленияДеятельности.ЗакрепленныеСотрудники.(
	|		НомерСтроки,
	|		Сотрудник,
	|		РольСотрудника,
	|		ОСтроке
	|	)
	|ИЗ Справочник.НаправленияДеятельности КАК НаправленияДеятельности
	|ГДЕ НаправленияДеятельности.Ссылка В (&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьВидыДеятельностиШапка = Макет.ПолучитьОбласть("ВидыДеятельностиШапка");
	ОбластьВидыДеятельности = Макет.ПолучитьОбласть("ВидыДеятельности");
	ОбластьЗакрепленныеСотрудникиШапка = Макет.ПолучитьОбласть("ЗакрепленныеСотрудникиШапка");
	ОбластьЗакрепленныеСотрудники = Макет.ПолучитьОбласть("ЗакрепленныеСотрудники");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьВидыДеятельностиШапка);
		ВыборкаВидыДеятельности = Выборка.ВидыДеятельности.Выбрать();
		Пока ВыборкаВидыДеятельности.Следующий() Цикл
			ОбластьВидыДеятельности.Параметры.Заполнить(ВыборкаВидыДеятельности);
			ТабДок.Вывести(ОбластьВидыДеятельности, ВыборкаВидыДеятельности.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьЗакрепленныеСотрудникиШапка);
		ВыборкаЗакрепленныеСотрудники = Выборка.ЗакрепленныеСотрудники.Выбрать();
		Пока ВыборкаЗакрепленныеСотрудники.Следующий() Цикл
			ОбластьЗакрепленныеСотрудники.Параметры.Заполнить(ВыборкаЗакрепленныеСотрудники);
			ТабДок.Вывести(ОбластьЗакрепленныеСотрудники, ВыборкаЗакрепленныеСотрудники.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
